run/lidDriven/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          74;
        startFace       29326;
    }
    outlet
    {
        type            patch;
        nFaces          74;
        startFace       29400;
    }
    lowerWall
    {
        type            patch;
        nFaces          200;
        startFace       29474;
    }
    upperWall
    {
        type            patch;
        nFaces          200;
        startFace       29674;
    }
    frontAndBack
    {
        type            empty;
        nFaces          29600;
        startFace       29874;
    }
)

// ************************************************************************* //
