run/lidDriven/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho0            rho0 [1 -3 0 0 0 0 0] 9486;

nu              nu [0 2 -1 0 0 0 0] 2.27e-07;

T0              T0 [0 0 0 1 0 0 0] 0;

Cp              Cp [0 2 -2 -1 0 0 0] 200.2;

k               k [1 1 -3 -1 0 0 0] 17.243802575999997;

beta            beta [0 0 0 -1 0 0 0] 0.0001774;

a               a [0 1 0 0 0 0 0] 0.02;

b               b [0 1 0 0 0 0 0] 0.02;

sigma           sigma [-1 -3 3 0 0 2 0] 789000.0;

q0              q0 [1 -1 -3 0 0 0 0] 0;

m               m [0 0 0 0 0 0 0 ] 0;

coord           2;  //X_axis:1, Y_axis:2, Z_axis:3

coor            1;  //X_axis:0, Y_axis:1, Z_axis:2 // per iniLinearT

Ubar            Ubar [0 1 -1 0 0 0 0] (0 0 0);

g               g    [0 1 -2 0 0 0 0] (-9.81 0 0);

fd              false; // "true" for fully developed temp. averaging

DeltaT          DeltaT [0 0 0 1 0 0 0] 18.50585303402758;

HTpatches       ("upperWall"); //for Nusselt

// ************************************************************************* //
