run/lidDriven/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pFinal)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-20;
        relTol          0;
        minIter         3;
        maxIter         100;
    }

    "(U|UFinal)"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
        minIter         3;
        maxIter         100;
    }

    "(theta|thetaFinal)"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
        minIter         3;
        maxIter         100;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}



// ************************************************************************* //
