run/lidDriven/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (U);
interpolationScheme cellPointFace;
probeLocations
(
(7.782101167315176e-05 -0.01992217898832685 0.02)
(0.00023346303501945527 -0.01992217898832685 0.02)
(0.0003891050583657588 -0.01992217898832685 0.02)
(0.0005447470817120623 -0.01992217898832685 0.02)
(0.0007003891050583658 -0.01992217898832685 0.02)
(0.0008560311284046693 -0.01992217898832685 0.02)
(0.0010116731517509727 -0.01992217898832685 0.02)
(0.0011673151750972765 -0.01992217898832685 0.02)
(0.0013229571984435798 -0.01992217898832685 0.02)
(0.0014785992217898835 -0.01992217898832685 0.02)
(0.0016342412451361868 -0.01992217898832685 0.02)
(0.0017898832684824905 -0.01992217898832685 0.02)
(0.0019455252918287938 -0.01992217898832685 0.02)
(0.002101167315175097 -0.01992217898832685 0.02)
(0.002256809338521401 -0.01992217898832685 0.02)
(0.0024124513618677046 -0.01992217898832685 0.02)
(0.002568093385214008 -0.01992217898832685 0.02)
(0.002723735408560311 -0.01992217898832685 0.02)
(0.002879377431906615 -0.01992217898832685 0.02)
(0.0030350194552529186 -0.01992217898832685 0.02)
(0.003190661478599222 -0.01992217898832685 0.02)
(0.003346303501945525 -0.01992217898832685 0.02)
(0.003501945525291829 -0.01992217898832685 0.02)
(0.0036575875486381327 -0.01992217898832685 0.02)
(0.003813229571984436 -0.01992217898832685 0.02)
(0.003968871595330739 -0.01992217898832685 0.02)
(0.0041245136186770425 -0.01992217898832685 0.02)
(0.004280155642023347 -0.01992217898832685 0.02)
(0.00443579766536965 -0.01992217898832685 0.02)
(0.004591439688715953 -0.01992217898832685 0.02)
(0.0047470817120622575 -0.01992217898832685 0.02)
(0.004902723735408561 -0.01992217898832685 0.02)
(0.005058365758754864 -0.01992217898832685 0.02)
(0.005214007782101167 -0.01992217898832685 0.02)
(0.005369649805447471 -0.01992217898832685 0.02)
(0.005525291828793775 -0.01992217898832685 0.02)
(0.005680933852140078 -0.01992217898832685 0.02)
(0.005836575875486381 -0.01992217898832685 0.02)
(0.005992217898832686 -0.01992217898832685 0.02)
(0.006147859922178989 -0.01992217898832685 0.02)
(0.006303501945525292 -0.01992217898832685 0.02)
(0.0064591439688715955 -0.01992217898832685 0.02)
(0.006614785992217899 -0.01992217898832685 0.02)
(0.006770428015564203 -0.01992217898832685 0.02)
(0.006926070038910506 -0.01992217898832685 0.02)
(0.0070817120622568095 -0.01992217898832685 0.02)
(0.007237354085603114 -0.01992217898832685 0.02)
(0.007392996108949417 -0.01992217898832685 0.02)
(0.00754863813229572 -0.01992217898832685 0.02)
(0.0077042801556420236 -0.01992217898832685 0.02)
(0.007859922178988328 -0.01992217898832685 0.02)
(0.008015564202334631 -0.01992217898832685 0.02)
(0.008171206225680934 -0.01992217898832685 0.02)
(0.00832684824902724 -0.01992217898832685 0.02)
(0.008482490272373543 -0.01992217898832685 0.02)
(0.008638132295719846 -0.01992217898832685 0.02)
(0.00879377431906615 -0.01992217898832685 0.02)
(0.008949416342412453 -0.01992217898832685 0.02)
(0.009105058365758756 -0.01992217898832685 0.02)
(0.009260700389105059 -0.01992217898832685 0.02)
(0.009416342412451364 -0.01992217898832685 0.02)
(0.009571984435797667 -0.01992217898832685 0.02)
(0.00972762645914397 -0.01992217898832685 0.02)
(0.009883268482490274 -0.01992217898832685 0.02)
(0.010038910505836577 -0.01992217898832685 0.02)
(0.01019455252918288 -0.01992217898832685 0.02)
(0.010350194552529184 -0.01992217898832685 0.02)
(0.010505836575875487 -0.01992217898832685 0.02)
(0.01066147859922179 -0.01992217898832685 0.02)
(0.010817120622568096 -0.01992217898832685 0.02)
(0.010972762645914399 -0.01992217898832685 0.02)
(0.011128404669260702 -0.01992217898832685 0.02)
(0.011284046692607005 -0.01992217898832685 0.02)
(0.011439688715953309 -0.01992217898832685 0.02)
(0.011595330739299612 -0.01992217898832685 0.02)
(0.011750972762645915 -0.01992217898832685 0.02)
(0.01190661478599222 -0.01992217898832685 0.02)
(0.012062256809338524 -0.01992217898832685 0.02)
(0.012217898832684827 -0.01992217898832685 0.02)
(0.01237354085603113 -0.01992217898832685 0.02)
(0.012529182879377434 -0.01992217898832685 0.02)
(0.012684824902723737 -0.01992217898832685 0.02)
(0.01284046692607004 -0.01992217898832685 0.02)
(0.012996108949416343 -0.01992217898832685 0.02)
(0.013151750972762647 -0.01992217898832685 0.02)
(0.013307392996108952 -0.01992217898832685 0.02)
(0.013463035019455255 -0.01992217898832685 0.02)
(0.013618677042801558 -0.01992217898832685 0.02)
(0.013774319066147862 -0.01992217898832685 0.02)
(0.013929961089494165 -0.01992217898832685 0.02)
(0.014085603112840468 -0.01992217898832685 0.02)
(0.014241245136186772 -0.01992217898832685 0.02)
(0.014396887159533077 -0.01992217898832685 0.02)
(0.01455252918287938 -0.01992217898832685 0.02)
(0.014708171206225683 -0.01992217898832685 0.02)
(0.014863813229571986 -0.01992217898832685 0.02)
(0.01501945525291829 -0.01992217898832685 0.02)
(0.015175097276264593 -0.01992217898832685 0.02)
(0.015330739299610896 -0.01992217898832685 0.02)
...
);

// ************************************************************************* //
